org/blog/aesara-randvar-shape-semantics.org
#+title: Shape semantics for random variables in Aesara
#+date: <2022-08-17 Wed>
#+PROPERTY: header-args :results output :eval never-export :exports both

[[id:5a5e87b1-558c-43db-ad38-32a073b10351][Aesara]] has shape semantics for random variables: the shape of random tensors is partitionned in semantically different pieces.

* TL; DR

- The /support shape/ is the shape of one draw;
- The /batch shape/ determines the number of independent draws we want from the random variable;
- The /batch shape/ can be infered using broadcasting rules for the distribution parameters, and broadcasting shapes with the =size= keyword argument;
- The shape of samples is given by =sample_shape = batch_shape + support_shape=

* Support shape

Let us forget everything we said about the batch shape above.

Here we have
- Scalar
- Vectors (1 dimension)
- Matrices (2 dimensions)

The first distinction we must make is based on the /support/ of the distributions. Simply put, the support of a distribution is the domain over which the probability density (mass) function of the distribution is defined.

The support shape is the shape of one draw.

The support of the normal distribution, for instance, is the real line: every sample drawn from that distribution will be a real number. The support of the bernoulli distribution, on the other hand, is the set of integers $\left\{0, 1\right\}. These distributions are /scalar distributions/, in the sense that their support has 0 dimension (in /array/ terms). Their support shape is /always/ =(,)=.

#+begin_src python
import aesara.tensor as at

srng = at.random.RandomStream(0)
rv = srng.normal(0, 1)
sample = rv.eval()

print(f"sample value: {sample}")
print(f"support shape: {sample.shape}")
#+end_src

#+RESULTS:
: sample value: 1.4436909546981256
: support shape: ()

Other distributions are defined on more complex spaces. The multivariate normal distribution, for instance, is 1-dimentsional and can be defined for an arbitrary number of components $k$. In this case the support shape is of length 1 and equal to =(k,)=.

#+begin_src python
import aesara.tensor as at
import numpy as np

srng = at.random.RandomStream(0)

d = 4
mu = np.random.rand(d)
sigma = np.eye(d)
rv = srng.multivariate_normal(mu, sigma)
sample = rv.eval()

print(f"sample value: {sample}")
print(f"support shape: {sample.shape}")
#+end_src

#+RESULTS:
: sample value: [ 1.98832878 -0.61854378  1.36816224  0.02745684]
: support shape: (4,)

We can define a multivariate normal distribution with one component, and for consistency its support shape is equal to =(1,)=.

#+begin_src python
import aesara.tensor as at
import numpy as np

srng = at.random.RandomStream(0)

mu = np.array([1])
sigma = np.eye(1)
rv = srng.multivariate_normal(mu, sigma)
sample = rv.eval()

print(f"sample value: {sample}")
print(f"support shape: {sample.shape}")
#+end_src

#+RESULTS:
: sample value: [2.44369095]
: support shape: (1,)

Example of distributions with 1-dimensional support: =multivariate_normal=, =categorical=, =multinomial=, =dirichlet=.

Finally, distributions can be defined on a space with an arbitrary number of dimensions. The [[https://en.wikipedia.org/wiki/Wishart_distribution][Wishart distribution]] for instance is 2-dimensional: a sample from this distribution is a matrix.

** Broadcasting

When we broadcast the parameters of a non-scalar distribution, two things need to be defined:
1. The support shape
2. The batch shape

In the case of the multinomial distribution, the size of the last dimension of $p$ determines the support shape. Then the formula applies:

=sample_shape = batch_shape + support_shape=

#+begin_src python
import aesara.tensor as at
import numpy as np

n = np.array([10, 9])
p = np.array([[.8, .1, .1], [.4, .1, .5]])

srng = at.random.RandomStream(0)
rv = srng.multinomial(n, p)

sample = rv.eval()
print(f"sample value: {sample}")
print(f"sample shape: {sample.shape}")
print(f"support shape: {sample.shape[-1:]}")
print(f"batch shape: {sample.shape[0]}")
#+end_src

#+RESULTS:
: sample value: [[6 2 2]
:  [4 0 5]]
: sample shape: (2, 3)
: support shape: (3,)
: batch shape: 2


* Batch shape

In the following we will only consider scalar (univariate) distributions.

These are the distributions whose support is 1-dimensional; samples from these distribution are scalar values. Let's draw a sample from the normal distribution with Aesara to illustrate this:

#+begin_src python
import aesara.tensor as at

srng = at.random.RandomStream(0)
rv = srng.normal(0, 1)
sample = rv.eval()

print(f"sample value: {sample}")
print(f"sample shape: {sample.shape}")
#+end_src

#+RESULTS:
: sample value: 1.4436909546981256
: sample shape: ()

