blog/aesara-randvar-shape-semantics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-23 Tue 17:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shape semantics for random variables in Aesara</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Shape semantics for random variables in Aesara</h1>
<p>
<a href="../20220729163627-aesara.html#ID-5a5e87b1-558c-43db-ad38-32a073b10351">Aesara</a> has shape semantics for random variables: the shape of random tensors is partitionned in semantically different pieces.
</p>

<div id="outline-container-org6162076" class="outline-2">
<h2 id="org6162076">TL; DR</h2>
<div class="outline-text-2" id="text-org6162076">
<ul class="org-ul">
<li>The <i>support shape</i> is the shape of one draw;</li>
<li>The <i>batch shape</i> determines the number of independent draws we want from the random variable;</li>
<li>The <i>batch shape</i> can be infered using broadcasting rules for the distribution parameters, and broadcasting shapes with the <code>size</code> keyword argument;</li>
<li>The shape of samples is given by <code>sample_shape = batch_shape + support_shape</code></li>
</ul>
</div>
</div>

<div id="outline-container-org81e8589" class="outline-2">
<h2 id="org81e8589">Support shape</h2>
<div class="outline-text-2" id="text-org81e8589">
<p>
Let us forget everything we said about the batch shape above.
</p>

<p>
Here we have
</p>
<ul class="org-ul">
<li>Scalar</li>
<li>Vectors (1 dimension)</li>
<li>Matrices (2 dimensions)</li>
</ul>

<p>
The first distinction we must make is based on the <i>support</i> of the distributions. Simply put, the support of a distribution is the domain over which the probability density (mass) function of the distribution is defined.
</p>

<p>
The support shape is the shape of one draw.
</p>

<p>
The support of the normal distribution, for instance, is the real line: every sample drawn from that distribution will be a real number. The support of the bernoulli distribution, on the other hand, is the set of integers $\left\{0, 1\right\}. These distributions are <i>scalar distributions</i>, in the sense that their support has 0 dimension (in <i>array</i> terms). Their support shape is <i>always</i> <code>(,)</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.normal(0, 1)
<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()

<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"support shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample value: 1.4436909546981256
support shape: ()
</pre>


<p>
Other distributions are defined on more complex spaces. The multivariate normal distribution, for instance, is 1-dimentsional and can be defined for an arbitrary number of components \(k\). In this case the support shape is of length 1 and equal to <code>(k,)</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)

<span style="font-weight: bold; font-style: italic;">d</span> = 4
<span style="font-weight: bold; font-style: italic;">mu</span> = np.random.rand(d)
<span style="font-weight: bold; font-style: italic;">sigma</span> = np.eye(d)
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.multivariate_normal(mu, sigma)
<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()

<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"support shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample value: [ 1.98832878 -0.61854378  1.36816224  0.02745684]
support shape: (4,)
</pre>


<p>
We can define a multivariate normal distribution with one component, and for consistency its support shape is equal to <code>(1,)</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)

<span style="font-weight: bold; font-style: italic;">mu</span> = np.array([1])
<span style="font-weight: bold; font-style: italic;">sigma</span> = np.eye(1)
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.multivariate_normal(mu, sigma)
<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()

<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"support shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample value: [2.44369095]
support shape: (1,)
</pre>


<p>
Example of distributions with 1-dimensional support: <code>multivariate_normal</code>, <code>categorical</code>, <code>multinomial</code>, <code>dirichlet</code>.
</p>

<p>
Finally, distributions can be defined on a space with an arbitrary number of dimensions. The <a target='_blank' rel='noopener noreferrer' class='external' href="https://en.wikipedia.org/wiki/Wishart_distribution">Wishart distribution</a> for instance is 2-dimensional: a sample from this distribution is a matrix.
</p>
</div>

<div id="outline-container-org5f47d3e" class="outline-3">
<h3 id="org5f47d3e">Broadcasting</h3>
<div class="outline-text-3" id="text-org5f47d3e">
<p>
When we broadcast the parameters of a non-scalar distribution, two things need to be defined:
</p>
<ol class="org-ol">
<li>The support shape</li>
<li>The batch shape</li>
</ol>

<p>
In the case of the multinomial distribution, the size of the last dimension of \(p\) determines the support shape. Then the formula applies:
</p>

<p>
<code>sample_shape = batch_shape + support_shape</code>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">n</span> = np.array([10, 9])
<span style="font-weight: bold; font-style: italic;">p</span> = np.array([[.8, .1, .1], [.4, .1, .5]])

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.multinomial(n, p)

<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample shape: {sample.shape}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"support shape: {sample.shape[-1:]}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"batch shape: {sample.shape[0]}"</span>)
</pre>
</div>

<pre class="example">
sample value: [[6 2 2]
 [4 0 5]]
sample shape: (2, 3)
support shape: (3,)
batch shape: 2
</pre>
</div>
</div>
</div>


<div id="outline-container-org9f9b85e" class="outline-2">
<h2 id="org9f9b85e">Batch shape</h2>
<div class="outline-text-2" id="text-org9f9b85e">
<p>
In the following we will only consider scalar (univariate) distributions.
</p>

<p>
These are the distributions whose support is 1-dimensional; samples from these distribution are scalar values. Let's draw a sample from the normal distribution with Aesara to illustrate this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.normal(0, 1)
<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()

<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample value: 1.4436909546981256
sample shape: ()
</pre>
</div>
