blog/aesara-randvar-shape-semantics.html

<div id="outline-container-org2bc90d5" class="outline-3">
<h3 id="org2bc90d5">Batching</h3>
<div class="outline-text-3" id="text-org2bc90d5">
<p>
If we want to take \(3\) independent and indentically distributed samples from this distribution we can use the <code>size</code> keyword argument:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.normal(0, 1, size=(3,))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">size=3 gives the same result</span>
<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()

<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample value: [ 1.44369095 -0.89594598  0.73595567]
sample shape: (3,)
</pre>


<p>
We can request <i>tensors</i> with independent and identically distributed samples of arbitrary shape:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)
<span style="font-weight: bold; font-style: italic;">batch_shape</span> = (2, 2, 2)
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.normal(0, 1, size=batch_shape)
<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()

<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample value: [[[ 1.44369095 -0.89594598]
  [ 0.73595567  0.00587704]]

 [[ 0.85338179  0.16094803]
  [ 0.81931469  0.80565568]]]
sample shape: (2, 2, 2)
</pre>


<p>
We will say that <code>size</code> explicits the <i>batch shape</i>, which is the shape of the tensor of idependent random variables produced by the op. In this example the random variables are identically distributed, but this need not be the case.
</p>
</div>
</div>

<div id="outline-container-orgb6141b9" class="outline-3">
<h3 id="orgb6141b9">Vectorizing</h3>
<div class="outline-text-3" id="text-orgb6141b9">
<p>
Say we want a sample from three normal distributions with a \(0\), \(3\) and \(5\) mean value respectively. One (cumbersome) way to achieve this is:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream()
<span style="font-weight: bold; font-style: italic;">rv_0</span> = srng.normal(0, 1)
<span style="font-weight: bold; font-style: italic;">rv_3</span> = srng.normal(3, 1)
<span style="font-weight: bold; font-style: italic;">rv_5</span> = srng.normal(5, 1)
<span style="font-weight: bold; font-style: italic;">rv</span> = at.stack([rv_0, rv_3, rv_5])

<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample value: [-0.41520246  1.92093324  6.74827434]
sample shape: (3,)
</pre>


<p>
To simplify this common operation we can use pass arrays as parameters:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)

<span style="font-weight: bold; font-style: italic;">mean</span> = np.array([0, 3, 5])
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.normal(mean, 1)

<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample values: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"batch shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample value: [1.44369095 2.10405402 5.73595567]
sample shape: (3,)
</pre>


<p>
In this case the <i>batch shape</i> is also  <code>(3,)</code>; it is the shape of the tensor that contains random variables that are independently distributed and whose distribution belong to the same family.
</p>

<p>
We can also use arrays for the standard deviation in this case. Standard broadcasting rules apply to determine the batch shape. For instance, the following fails with a shape mismatch error:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)

<span style="font-weight: bold; font-style: italic;">mean</span> = np.array([0, 3, 5])
<span style="font-weight: bold; font-style: italic;">sigma</span> = np.array([1, 2])
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.normal(mean, sigma)

<span style="font-weight: bold;">try</span>:
    rv.<span style="font-weight: bold;">eval</span>()
<span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span> <span style="font-weight: bold;">as</span> err:
    <span style="font-weight: bold;">print</span>(err)
</pre>
</div>

<pre class="example" id="org7086bbe">
shape mismatch: objects cannot be broadcast to a single shape.  Mismatch is between arg 0 with shape (3,) and arg 1 with shape (2,).
Apply node that caused the error: normal_rv{0, (0, 0), floatX, True}(RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7F8DCB881A80&gt;), TensorConstant{[]}, TensorConstant{11}, TensorConstant{[0 3 5]}, TensorConstant{[1 2]})
Toposort index: 0
Inputs types: [RandomGeneratorType, TensorType(int64, (0,)), TensorType(int64, ()), TensorType(int64, (3,)), TensorType(int64, (2,))]
Inputs shapes: ['No shapes', (0,), (), (3,), (2,)]
Inputs strides: ['No strides', (0,), (), (8,), (8,)]
Inputs values: [Generator(PCG64) at 0x7F8DCB881A80, array([], dtype=int64), array(11), array([0, 3, 5]), array([1, 2])]
Outputs clients: [['output'], ['output']]

HINT: Re-running with most Aesara optimizations disabled could provide a back-trace showing when this node was created. This can be done by setting the Aesara flag 'optimizer=fast_compile'. If that does not work, Aesara optimizations can be disabled with 'optimizer=None'.
HINT: Use the Aesara flag `exception_verbosity=high` for a debug print-out and storage map footprint of this Apply node.
</pre>

<p>
Indeed <code>mean</code> and <code>sigma</code> cannot be broadcast together:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">mean</span> = np.array([0, 3, 5])
<span style="font-weight: bold; font-style: italic;">sigma</span> = np.array([1, 2])
<span style="font-weight: bold;">try</span>:
    np.broadcast(mean, sigma)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">error</span>
<span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span> <span style="font-weight: bold;">as</span> err:
    <span style="font-weight: bold;">print</span>(err)
</pre>
</div>

<pre class="example">
shape mismatch: objects cannot be broadcast to a single shape.  Mismatch is between arg 0 with shape (3,) and arg 1 with shape (2,).
</pre>


<p>
<code>np.broadcast(mean, sigma)</code> gives us the batch shape:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">mean</span> = np.array([0, 3, 5])
<span style="font-weight: bold; font-style: italic;">sigma</span> = np.array([1, 2, 7])
<span style="font-weight: bold;">print</span>(np.broadcast(mean, sigma).shape)
</pre>
</div>

<pre class="example">
(3,)
</pre>


<p>
Indeed:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)

<span style="font-weight: bold; font-style: italic;">mean</span> = np.array([0, 3, 5])
<span style="font-weight: bold; font-style: italic;">sigma</span> = np.array([1, 2, 3])
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.normal(mean, sigma)

<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample values: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"batch shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample values: [1.44369095 1.20810805 7.20786701]
batch shape: (3,)
</pre>
</div>
</div>
