org/blog/aesara-randvar-shape-semantics.org
** Vectorizing + Batching

It is possible to vectorize and batch at the same time. Note that =size= and that vectorized shape must be broadcastable

#+begin_src python
import aesara.tensor as at
import numpy as np

srng = at.random.RandomStream(0)

mean = np.array([0, 3, 5])
sigma = np.array([1, 2, 3])
rv = srng.normal(mean, sigma, size=(2, 2, 3))

sample = rv.eval()
print(f"sample values: {sample}")
print(f"batch shape: {sample.shape}")
#+end_src

#+RESULTS:
: sample values: [[[1.44369095e+00 1.20810805e+00 7.20786701e+00]
:   [5.87704041e-03 4.70676358e+00 5.48284410e+00]]
:
:  [[8.19314690e-01 4.61131137e+00 5.65270195e+00]
:   [9.70078743e-01 1.52177388e+00 6.78043377e+00]]]
: batch shape: (2, 2, 3)

where =np.broadcast(mean, sigma).shape= must correspond to the last dimensions of =size=. Or in other words, the sample shape is =np.broadcast_shapes(np.broadcast(mean, sigma).shape, size)= if this does not raise an error.

=sample_shape = np.broadcast_shapes(np.broadcast(*args), size)=

* All together

Same thing, =size= defines the batch shape, and =aesara= will raise an exception if this is not correctly set.

#+begin_src python
import aesara.tensor as at
import numpy as np

n = np.array([10, 9])
p = np.array([[.8, .1, .1], [.4, .1, .5]])

srng = at.random.RandomStream(0)
rv = srng.multinomial(n, p, size=(3, 2))

sample = rv.eval()
print(f"sample value: {sample}")
print(f"sample shape: {sample.shape}")
print(f"support shape: {sample.shape[-1:]}")
print(f"batch shape: {sample.shape[:-1]}")
#+end_src

#+RESULTS:
#+begin_example
sample value: [[[6 2 2]
  [4 0 5]]

 [[8 1 1]
  [1 2 6]]

 [[9 0 1]
  [5 0 4]]]
sample shape: (3, 2, 3)
support shape: (3,)
batch shape: (3, 2)
#+end_example
