blog/aesara-randvar-shape-semantics.html

<div id="outline-container-orgbd0f51b" class="outline-3">
<h3 id="orgbd0f51b">Vectorizing + Batching</h3>
<div class="outline-text-3" id="text-orgbd0f51b">
<p>
It is possible to vectorize and batch at the same time. Note that <code>size</code> and that vectorized shape must be broadcastable
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)

<span style="font-weight: bold; font-style: italic;">mean</span> = np.array([0, 3, 5])
<span style="font-weight: bold; font-style: italic;">sigma</span> = np.array([1, 2, 3])
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.normal(mean, sigma, size=(2, 2, 3))

<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample values: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"batch shape: {sample.shape}"</span>)
</pre>
</div>

<pre class="example">
sample values: [[[1.44369095e+00 1.20810805e+00 7.20786701e+00]
  [5.87704041e-03 4.70676358e+00 5.48284410e+00]]

 [[8.19314690e-01 4.61131137e+00 5.65270195e+00]
  [9.70078743e-01 1.52177388e+00 6.78043377e+00]]]
batch shape: (2, 2, 3)
</pre>


<p>
where <code>np.broadcast(mean, sigma).shape</code> must correspond to the last dimensions of <code>size</code>. Or in other words, the sample shape is <code>np.broadcast_shapes(np.broadcast(mean, sigma).shape, size)</code> if this does not raise an error.
</p>

<p>
<code>sample_shape = np.broadcast_shapes(np.broadcast(*args), size)</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org4663d18" class="outline-2">
<h2 id="org4663d18">All together</h2>
<div class="outline-text-2" id="text-org4663d18">
<p>
Same thing, <code>size</code> defines the batch shape, and <code>aesara</code> will raise an exception if this is not correctly set.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">import</span> numpy <span style="font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">n</span> = np.array([10, 9])
<span style="font-weight: bold; font-style: italic;">p</span> = np.array([[.8, .1, .1], [.4, .1, .5]])

<span style="font-weight: bold; font-style: italic;">srng</span> = at.random.RandomStream(0)
<span style="font-weight: bold; font-style: italic;">rv</span> = srng.multinomial(n, p, size=(3, 2))

<span style="font-weight: bold; font-style: italic;">sample</span> = rv.<span style="font-weight: bold;">eval</span>()
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample value: {sample}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"sample shape: {sample.shape}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"support shape: {sample.shape[-1:]}"</span>)
<span style="font-weight: bold;">print</span>(f<span style="font-style: italic;">"batch shape: {sample.shape[:-1]}"</span>)
</pre>
</div>

<pre class="example" id="orgbb851eb">
sample value: [[[6 2 2]
  [4 0 5]]

 [[8 1 1]
  [1 2 6]]

 [[9 0 1]
  [5 0 4]]]
sample shape: (3, 2, 3)
support shape: (3,)
batch shape: (3, 2)
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-08-17 Wed 00:00</p>
<p class="author">Author: Rémi Louf</p>
<p class="email">Email: <a href="mailto:remi@thetypicalset.com">remi@thetypicalset.com</a></p>
<p class="date">Created: 2022-08-23 Tue 17:18</p>
</div>
</body>
</html>
